SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( OR-62666-B

Comment( ******REPORT BASED ADVANCED FEATURES APPLIED******* )

Comment( ************** General Information***************** )
Type ( Engine )
WagonShape ( CCW_BR_D11_62666.s )
Size  ( 2.636583m 3.937911m 10.5915m )
WheelRadius ( 21in )comment (Front Bogie)
Mass ( 61.15t-uk )

Comment( ************ Coupler Information ****************** )
	
Comment( == Rear Coupler == )
Coupling (
		Type ( Bar )
		Spring (
			Comment(Stiffness ( 1e7N/m 1e7N/m ))
			Comment(Damping ( 0.2e7N/m 0.2e7N/m ))
			Break ( 710kN 1220kN )
			r0 ( 10cm 0cm )
		)
		CouplingHasRigidConnection (1)
		Comment(Velocity (0.1m/s))
		Comment(CouplingUniqueType (DR_BR_8P_71000))
	)
Comment( == Front Coupler == )
	Coupling (
			Type ( Chain )
			Spring (
			Comment(Stiffness ( 1e6N/m 2e6N/m ))
			Comment(Damping ( 1e6N/m 1e6N/m ))
			Break ( 600kN 1000kN )
			r0 ( 20cm 0cm )
			)
	CouplingHasRigidConnection (0)
	Comment(Velocity (-0.1m/s))
	)
	
Comment( ********** Brakes, Type, Force, etc *************** )
BrakeEquipmentType( Vacuum_brake, Auxilary_reservoir )
BrakeSystemType( Vacuum_single_pipe )
MaxBrakeForce( 168kN )
BrakeCylinderPressureForMaxBrakeBrakeForce ( 21inHg )

ORTSNumberBrakeCylinders ( 2 )
Comment ( Assume 1 x 30in vacuum cylinder with 9in stroke )
Comment ( OpenRails assumes 4.5in stroke so this is set as two cylinders )
ORTSBrakeCylinderSize ( 30in )
ORTSAuxilaryResCapacity ( 8.25ft^3 ) Comment ( Based on Phillipson 16.5ft^3 vacuum chamber for 30in x 9in vacuum cylinder )

Brakepipevolume (1.29ft^3 ) Comment (* based on length of loco plus 16 feet for bends, branches and hoses *)

MaxReleaseRate ( 2.5inHg/s ) 
Comment ( use MaxReleaseRate ( 10inHg/s ) for steam braked class V2; MaxReleaseRate ( 2.5inHg/s )for vacuum braked class V2 )

MaxApplicationRate ( 2.0inHg/s )
Comment ( use MaxApplicationRate ( 1.3inHg/s ) for steam braked class V2; MaxApplicationRate ( 2.0inHg/s )for vacuum braked class V2 )

Comment (* Cast Iron Brakeshoes *)
ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121) 

Comment( ********* Curve Resistance & SuperElevation ********* )
CentreOfGravity ( 0m 2.8m 0m )
ORTSTrackGauge ( 4ft 8.5in )
ORTSUnbalancedSuperelevation ( 6in )
ORTSRigidWheelbase ( 10.0ft 0.0in )

Comment( ***************** Friction************************* )

ORTSBearingType ( Friction )

Comment( CN 1990 DWx18)
ORTSDavis_A ( 4346 )
ORTSDavis_B ( 20.44 )
ORTSDavis_C ( 5.432 )

ORTSWagonFrontalArea (100)
ORTSDavisDragConstant (0.0024)

Comment(  ******* Lights Section *******  Included in this section - Type, Colour, Location, Size, Control, etc)


Lights ( 8
  Light (
   comment( Flickering firebox )
   Type  ( 0 )
   Conditions (
    Headlight ( 0 )
    Unit ( 0 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( -0 2.432 -4.25 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 1.4 )
   )
   State (
   Duration ( 0.05 )
   LightColour ( 80ffe610 )
   Position ( -0 2.432 -4.28 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 1.4 )
         
     )
    )
   )
  Light ( 
   comment( Gauge glass Lamp )
   Type ( 0 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 1
   State (
   Duration ( 0.0 )
   LightColour ( 80ffe610 )
   Position ( 0 3.2 -4.30 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 0.35 )
     )
    )
   )
  Light (
   comment( Flickering Ashpan Back )
   Type  ( 0 )
   Conditions (
   Headlight ( 0 )
   Unit ( 0 )
   )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( 0 0.4 -4.5 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 1 )
   )
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( 0 0.45 -4.5 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 1 )
         
     )
    )
   )

  Light (
   comment( Sphere of light for Exhaust )
   Type  ( 1 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   )
   Cycle  ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
   State (
   Duration ( 0.0 )
   LightColour ( 80ffe610 )
   Position ( 0 10.0 -14.75 )
   Transition ( 0 )
   Radius ( 6.0 )
   Angle ( 90.0 )
                               )
                         )
         )
  Light ( 
   comment( Ashpan flashes ) 
   Type ( 0 ) 
   Conditions ( 
   Headlight ( 3 ) 
   Unit ( 0 ) 
   ) 
   Cycle ( 0 ) 
   FadeIn ( 0 ) 
   FadeOut ( 0.5 ) 
   States ( 28 
   State ( 
   Duration ( 1 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -2.50 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 2 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.50 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 2 ) 
   ) 
   State ( 
   Duration ( 0.30 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 01.4 -2.50 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.4 -2.50 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.50 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.30 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -2.50 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.5 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.2 )
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.30 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -2.2 )
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.2 )
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.2 )
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.30 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -2.2 )
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.2 )
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.5 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -2.2 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.2 )
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.2 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 3 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -2.5 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.5 )
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.5 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 5 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -2.5 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.5 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.30 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -2.5 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.50 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.5 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.50 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.4 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.50 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -2.50 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.50 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 2 ) 
   ) 
   State ( 
   Duration ( 0.6 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.5 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
                  )
               )
          )

  Light ( 
   comment( Chimney Sparks RS1AA ) 
   Type  ( 0 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   TimeOfDay ( 0 )
   Weather ( 0 )
   Coupling ( 0 )  
   )
   Cycle ( 0 ) 
   FadeIn ( 0 ) 
   FadeOut ( 0.5 ) 
   States ( 28 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 3.14 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.125 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.22 3.14 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.125 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.42 3.14 )

   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.15 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.72 3.14 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.10 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.52 3.14 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.125 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.72 3.14 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.15 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.92 3.14 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.10 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.32 3.14 )
  
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.15 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.52 3.14 )
 
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.25 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.92 3.14 )
 
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.1 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.35 3.14 )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.55 3.14 )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.25 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 3.14 )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.130 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.22 3.14 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.535 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.22 3.14 )
 
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.5135 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 3.14 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.135 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 7.22 3.14 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.135 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.14 )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.35 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.14 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.135 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 00000000 ) 
   Position ( 0 5.22 3.14 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.135 ) 
   ) 
   State ( 
   Duration ( 0.4 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.14 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.25 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 00000000 ) 
   Position ( 0 5.22 3.14)
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.135 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 3.14 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.135 ) 
   ) 
   State ( 
   Duration ( 0.5 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.14 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.135 ) 
   ) 
   State ( 
   Duration ( 0.4 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.14 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.1233 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 00000000 ) 
   Position ( 0 6.22 3.14 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.123 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.14 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.123 ) 
   ) 
   State ( 
   Duration ( 0.6 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 9.22 3.14 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.1230 ) 
                  )
               )
          )
 Light (
   comment( light white )
   Type ( 0 )
   Conditions (
   Headlight ( 4 )
   Unit ( 2 )
   Service ( 2 )
   )
   FadeIn ( 0.5 )
   FadeOut( 0.5 )
   Cycle   ( 0 )
   States( 1
   State (
   Duration ( 0.05 )
   LightColour ( cccccccc )
   Position ( 0 3.5 4.23 )
   Azimuth ( 0 0 0 )
   Transition ( 0 )
   Radius ( 0.6 )
    )
    )
    )
 Light (
   comment( light red reversed )
   Type ( 0 )
   Conditions (
   Headlight ( 4 )
   Unit ( 4 )
   Service ( 2 )
   )
   FadeIn ( 0.5 )
   FadeOut( 0.5 )
   Cycle   ( 0 )
   States( 1
   State (
   Duration ( 0.05 )
   LightColour ( ccff0000 )
   Position ( 0 3.5 4.23 )
   Azimuth ( 0 0 0 )
   Transition ( 0 )
   Radius ( 0.6 )
    )
    )
    )
    )
	
Comment( ******* Miscellaneous Wagon Information************ )

Comment (Passenger View)	
	Inside (
        PassengerCabinFile ( CCW_BR_D11_62666.s )
        PassengerCabinHeadPos ( 1.423 3.0 -3.5 )
        RotationLimit ( 90 180 160 )
        StartDirection ( 0 0 0 )
  	)
 Sound (	"..\\..\\Common.Steam\\2Cylinder\\K1eng.sms" )
)

Engine ( OR-62666-B

Effects
	(
	SteamSpecialEffects	(
	comment(the format of these little blocks is as follow:

	offset.x offset.y offset.z
	normal.x normal.y normal.z
	width in metres

	defining the offset from the shape pivot point where steam / 	smoke should appear, the direction it should go and the 	width of the nozzle
			)
   WhistleFX
   (
    0 3.85 -3.4
    0 1 0
    0.15
   )

   SafetyValvesFX
   (
    0 4.40 -2.55
    0 1 0
    0.350
   )
   SafetyValvesFX
   (
    0 4.40 -2.55
    0 1 0
    0.15
   )
   StackFX
   (
    0 4.10 3.15
    0 1 0
    0.25
   )
   DrainpipeFX
   (
    -1.5 1.258 -3.886
    0 -1 0
    0.05
   )
			
Injectors2FX
	(
	-1.2 1.2 -5.1
	0 -1 0
	0.12
	)
Injectors1FX
	(
	1.2 1.2 -5.1
	0 -1 0
	0.12
	)
CylindersFX
   (
    -0.7 0.5 4
    -0.0875 0 1 Comment(10 deg angle, tan-1 of 0.1763)
    0.16
   )
CylindersFX
   (
    0.7 0.5 4
    0.1763 0 1 Comment(10 deg angle, tan-1 of 0.1763)
    0.16
   )
  )
)

Wagon ( OR-62666-B )
Comment ( *************General Information****************** )

ORTSSteamLocomotiveType ( Simple )
Type ( Steam )
WheelRadius ( 40.5in )
NumWheels ( 2 )
ORTSDriveWheelWeight ( 39.8t-uk )
Sanding ( 25mph )

Comment ( ******************** Boiler ************************ )

ORTSSteamBoilerType ( Superheated )
BoilerVolume ( 204ft^3 )  
ORTSEvaporationArea ( 1543ft^2 )
ORTSSuperheatArea ( 209ft^2 )
MaxBoilerPressure ( 180psi )
MaxSteamHeatingPressure ( 50psi )

Comment ( ****************** Cylinders *********************** )

NumCylinders ( 2 )
CylinderStroke ( 26in ) 
CylinderDiameter ( 20in ) 
ORTSCylinderEfficiencyRate ( 1.0 )  

Comment ( ********************* Fire ************************* ) 

ORTSFuelCalorific ( 13700btu/lb )
ORTSGrateArea ( 31ft^2 )
SteamFiremanMaxPossibleFiringRate( 3000 ) 
ShovelCoalMass ( 14lb )     

Comment ( ****************** Fuel ************************* )

MaxTenderCoalMass ( 6t-uk )
MaxTenderWaterMass ( 40000lb )
IsTenderRequired( 1 )	

ORTSWaterScoopFillElevation ( 2.8m )
ORTSWaterScoopDepth ( 3.0in ) Comment (* LNER standard scoop - depth varies depending on trough and area of operation *)
ORTSWaterScoopWidth ( 10.875in )


Comment(       ********ADVANCED PARAMETERS**********      )

Comment(ORTSMaxIndicatedHorsepower ( 1151.0hp ))   

ORTSMaxSuperheatTemperature ( 225.0 )   

ORTSBoilerEfficiency( 0.0 0.91  190.0 0.455 )   
Comment(From Report)

ORTSBurnRate( 0.0 10.0   12000.0 1430.0   14000.0 1725.0   18000.0 2350.0   22000.0 3110.0   26000.0 4030.0   30000.0 5270.0   31000.0 5760.0  33000.0 8640 )   
Comment(From Report)

    
Comment ( ****************Brake System ******************** )   

BrakesTrainBrakeType( "Vacuum_single_pipe" )
ORTSBrakePipeTimeFactor ( 0.03s )
TrainPipeLeakRate ( 0.03inHg/s )


Comment ( *** Ejectors *** )
Comment (* Estimate for Davies & Metcalfe Type VB ejector *)
VacuumBrakesHasVacuumPump ( 0 )
ORTSBrakePipeChargingRate ( 0.32inHg/s )
VacuumBrakesLargeEjectorUsageRate ( 600lb/h )
VacuumBrakesSmallEjectorUsageRate ( 240lb/h )
VacuumBrakesMinBoilerPressureMaxVacuum ( 90psi )


Comment ( *** Train Brake Valve *** )
TrainBrakesControllerMaxSystemPressure ( 21inHg )
ORTSBrakeEmergencyTimeFactor ( 5s )
ORTSBrakePipeTimeFactor ( 0.02s )
ORTSBrakeServiceTimeFactor ( 10.0s )


Comment ( **************** Engine Controls ***************** )   
EngineControllers (
Regulator ( 0 1 0.0475 0 
            NumNotches( 0 )
    			)
Cutoff    ( -0.75 0.75 0.01 0 
            NumNotches( 0 )		
  		)

Brake_Train ( 0 1 0.1 0.5
NumNotches( 3
Notch(0    0 TrainBrakesControllerReleaseStart )
Notch(0.1  0 TrainBrakesControllerRunningStart )
Notch(0.2  1 TrainBrakesControllerVacuumContinuousServiceStart ) ) )

ORTSSmallEjector ( 0 1 0.1 0.55 NumNotches ( 0 ) )


FireDoor ( 0 1 0.1 0
	NumNotches ( 0 ))
Sanding( 0 1 0 )
Blower ( 0 1 0.025 0.2
	NumNotches ( 0 ))
Shovel ( 0 1 0.1 0
	NumNotches ( 0 ))
DampersFront ( 0 1 0.1 1
	NumNotches ( 0 ))
DampersBack ( 0 1 0.1 0
	NumNotches ( 0 ))
ORTSSteamHeat( 0 1 0.0125 0.5 )
Injector1Steam ( 0 1 0 )
Injector2Steam ( 0 1 0 )
Injector1Water ( 0 1 0.1 0
	NumNotches ( 0 ))
Injector2Water ( 0 1 0.1 0
	NumNotches ( 0 ))
CylinderCocks ( 0 1 1 )
Whistle ( 0 1 0 )
WaterScoop ( 0 1 0 )
)

Comment ( ************ Miscellaneous Information ************* )   

Cabview ( B1.cvf )
HeadOut (  -1.423 3.0 -3.5 )
Sound ( "..\\..\\Common.Steam\\2Cylinder\\K1cab.sms" )
Name ( "62666 D11 Robinson, ZEEBRUGGE, Local, Immingham Shed 40B, TE 19.64Klbf" )
Description (
"Robinson's D10 'Director (GCR Class 11E) locomotives quickly proved to be very successful, and a second batch was ordered in March 1916. This order was cancelled with World War 1 on-going. In 1917, Robinson built his B3 'Lord Faringdon' 4-6-0 locomotives. Although these were a significant improvement over his previous B2 'Sir Sam Fay' 4-6-0 locomotives and further B3s would be ordered, they were not an unqualified success. Hence a further batch of five 4-4-0s similar to the D10s were ordered. The new locomotives had a number of modifications and were would become known as 'Improved Directors'. They were given the Great Central Railway (GCR) classification of 11F, and the LNER classification of D11. The first batch was delivered between 1919 and 1920.)
The Improved Directors proved to be even more successful than the original D10s, and are generally acknowledged as Robinson's most successful express passenger design. A batch of six were ordered in 1922, when the GCR needed further express passenger locomotives.
In common with the D10 'Directors', the 'Improved Directors' never experienced any major rebuilding. The most significant modification was the fitting of long travel valves by Gresley.
By 1938, the D11/1s were allocated to Sheffield, Neasden, Gorton and Trafford Park. By this time, the six-coupled Gresley types such as the B17 4-6-0s, were taking over and the D11s were rarely seen on first class express passenger services. Wartime allocations included Retford, Lincoln, Immingham, and Langwith. The Langwith engines hauled heavy workmen's trains to the Ranskill Royal Ordnance Factory. In summer 1945, the D11/1s were allocated to Neasden (4), Mexborough (4), and Immingham (3). During the early 1950s, many of the D11s were allocated to Trafford Park and Heaton Mersey to operate the Cheshire Lines alongside other former GCR 4-4-0 locomotives. During the early 1950s, many of the Cheshire Lines 4-4-0s entered storage, as they were displaced by Midland Region types.
Both groups of D11s continued to perform well on their secondary duties during the 1940s and 1950s, and they were only displaced by the advent of large numbers of the Thompson B1s. With only smaller duties left for the D11s, many of them spent much of the decade in storage. Withdrawals did not start until the end of 1958, but they proceeded quickly. The last of the original GCR D11/1 locomotives were withdrawn in December 1960, and the last of the NBR D11/2s were withdrawn at the beginning of 1962. The first locomotive to be built, No. 506 Butler-Henderson was preserved as a part of the National Collection."
)
)